updated readme and decesions
